FV2310/E_1000.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Sperrprozesse Gas</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">19.2.1: AD: Unterbrechung der Anschlussnutzung (Sperren) auf Anweisung des LF</FONT></B><BR/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_1000</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Ist die Marktlokation bereits gesperrt?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation ist bereits gesperrt.<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Liegt für die Marktlokation im Zeitraum von 6 WT ab dem frühestmöglichen<BR align="left"/>Sperrtermin bereits ein Sperrauftrag vor?<BR align="left"/>>];
    "A10" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A10</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sperrauftrag für Marktlokation liegt bereits vor.<BR align="left"/></FONT>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Ist im gesamten Ausführungszeitraum des Sperrauftrags<BR align="left"/>(= frühestmöglicher Sperrtermin bis frühestmöglicher Sperrtermin + 6 WT) der<BR align="left"/>die Sperrung beauftragende LF der zu sperrenden Marktlokation zugeordnet?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A11</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zukünftiger bestätigter Lieferbeginn liegt gegenüber anderem Lieferanten bereits vor.<BR align="left"/>Die Ausführungsfrist der 6 WT ab dem frühestmöglichen Sperrtermin berührt das<BR align="left"/>bestätigte Lieferbeginndatum gegenüber anderem Lieferanten.<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Liegt an der zu sperrenden Marktlokation eine 1:1-Beziehung zwischen<BR align="left"/>Marktlokation und Messlokation vor?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine 1:1-Beziehung zwischen Marktlokation und Messlokation.<BR align="left"/>Hinweis: Gasspezifische Frage<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Wird die zu sperrende Marktlokation auf Basis von Grund- und Arbeitspreis<BR align="left"/>abgerechnet?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation wird nicht auf Basis von Grund- und Arbeitspreis abgerechnet.<BR align="left"/>Hinweis: Gasspezifische Frage<BR align="left"/></FONT>>];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>60: </B>Sind weitere Marktlokationen von der Sperrung betroffen, für die dieser<BR align="left"/>Sperrauftrag keine Wirkung entfalten darf?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Mindestens eine weitere Marktlokation ist von der Sperrung betroffen.<BR align="left"/></FONT>>];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>70: </B>Liegt im gesamten Ausführungszeitraum ein bestätigter Lieferbeginn gegenüber<BR align="left"/>dem beauftragenden LF vor?<BR align="left"/>>];
    "A12" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A12</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Im Ausführungszeitraum liegt bereits ein bestätigter Lieferbeginn gegenüber dem<BR align="left"/>beauftragenden LF vor.<BR align="left"/></FONT>>];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>80: </B>Liegt ein Verhinderungsgrund einer Sperrung an der Marktlokation vor?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Verhinderungsgrund liegt vor.<BR align="left"/>Hinweis: Das identifizierte Problem ist in der<BR align="left"/> Antwort zu beschreiben/benennen.<BR align="left"/></FONT>>];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>90: </B>Ist der Sperrauftrag termingebunden?<BR align="left"/>>];
    "100" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>100: </B>Liegt der übermittelte Sperrtermin mindestens 12 WT nach dem Eingangsdatum der<BR align="left"/>Nachricht des Sperrauftrags?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristverletzung bei einem termingebundenen Sperrauftrag.<BR align="left"/></FONT>>];
    "110" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>110: </B>Liegt der übermittelte frühestmögliche Sperrtermin mindestens 6 WT nach dem<BR align="left"/>Eingangsdatum der Nachricht des Sperrauftrags?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristverletzung bei einem nicht termingebundenen Sperrauftrag.<BR align="left"/></FONT>>];
    "120" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>120: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der<BR align="left"/>Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr<BR align="left"/></FONT>>];
    "130" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>130: </B>Kann der Sperrauftrag pauschal über das elektronische Preisblatt abgebildet werden?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Sperrung wird über das elektronische Preisblatt abgebildet.<BR align="left"/></FONT>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Die individuellen Sperrkosten werden in der Nachricht ausgetauscht.<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A01" [label="Ja"];
    "10" -> "20" [label="Nein"];
    "20" -> "A10" [label="Ja"];
    "20" -> "30" [label="Nein"];
    "30" -> "A11" [label="Nein"];
    "30" -> "40" [label="Ja"];
    "40" -> "A02" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "50" -> "A03" [label="Nein"];
    "50" -> "60" [label="Ja"];
    "60" -> "A04" [label="Ja"];
    "60" -> "70" [label="Nein"];
    "70" -> "A12" [label="Ja"];
    "70" -> "80" [label="Nein"];
    "80" -> "A05" [label="Ja"];
    "80" -> "90" [label="Nein"];
    "90" -> "100" [label="Ja"];
    "90" -> "110" [label="Nein"];
    "100" -> "A06" [label="Nein"];
    "100" -> "120" [label="Ja"];
    "110" -> "A07" [label="Nein"];
    "110" -> "120" [label="Ja"];
    "120" -> "A99" [label="Ja"];
    "120" -> "130" [label="Nein"];
    "130" -> "A08" [label="Ja"];
    "130" -> "A09" [label="Nein"];

    bgcolor="transparent";
}
